spec/cassettes/calculate_final_vat_discount.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=12&card[exp_year]=30&card[cvc]=222&metadata[country_code]=NL&metadata[vat_registered]=false&metadata[other]=random
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.2.3 p173 (2015-08-18)","platform":"x86_64-darwin14","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Pro.local 14.1.1 Darwin Kernel Version 14.1.1: Fri Feb  6
        21:06:10 PST 2015; root:xnu-2782.15.4~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '160'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 20 Jan 2016 17:30:53 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1462'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7kveWoFMQT4eLq
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_7kveTvcF9APeLI",
          "object": "customer",
          "account_balance": 0,
          "created": 1453311052,
          "currency": null,
          "default_source": "card_17VPnE2nHroS7mLXXI4P8eNa",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {
            "country_code": "NL",
            "vat_registered": "false",
            "other": "random"
          },
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_17VPnE2nHroS7mLXXI4P8eNa",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_7kveTvcF9APeLI",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7kveTvcF9APeLI/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7kveTvcF9APeLI/subscriptions"
          }
        }
    http_version: 
  recorded_at: Wed, 20 Jan 2016 17:30:56 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/plans/test
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.2.3 p173 (2015-08-18)","platform":"x86_64-darwin14","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Pro.local 14.1.1 Darwin Kernel Version 14.1.1: Fri Feb  6
        21:06:10 PST 2015; root:xnu-2782.15.4~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 20 Jan 2016 17:30:54 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '272'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7kvexneGF14Ki1
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "test",
          "object": "plan",
          "amount": 1499,
          "created": 1406556583,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "name": "Test Plan",
          "statement_descriptor": null,
          "trial_period_days": null
        }
    http_version: 
  recorded_at: Wed, 20 Jan 2016 17:30:57 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: US-ASCII
      string: customer=cus_7kveTvcF9APeLI&amount=315&currency=usd&description=vat&metadata[type]=vat&metadata[rate]=21
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.2.3 p173 (2015-08-18)","platform":"x86_64-darwin14","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Pro.local 14.1.1 Darwin Kernel Version 14.1.1: Fri Feb  6
        21:06:10 PST 2015; root:xnu-2782.15.4~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '104'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 20 Jan 2016 17:30:55 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '458'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7kve1ycok6U97R
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ii_17VPnH2nHroS7mLXJioUyY73",
          "object": "invoiceitem",
          "amount": 315,
          "currency": "usd",
          "customer": "cus_7kveTvcF9APeLI",
          "date": 1453311055,
          "description": "vat",
          "discountable": true,
          "invoice": null,
          "livemode": false,
          "metadata": {
            "type": "vat",
            "rate": "21"
          },
          "period": {
            "start": 1453311055,
            "end": 1453311055
          },
          "plan": null,
          "proration": false,
          "quantity": null,
          "subscription": null
        }
    http_version: 
  recorded_at: Wed, 20 Jan 2016 17:30:58 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/coupons/25OFF
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.2.3 p173 (2015-08-18)","platform":"x86_64-darwin14","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Pro.local 14.1.1 Darwin Kernel Version 14.1.1: Fri Feb  6
        21:06:10 PST 2015; root:xnu-2782.15.4~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 20 Jan 2016 17:30:56 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '312'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7kveKKz58EUvtC
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "25OFF",
          "object": "coupon",
          "amount_off": null,
          "created": 1410521489,
          "currency": null,
          "duration": "repeating",
          "duration_in_months": 3,
          "livemode": false,
          "max_redemptions": null,
          "metadata": {},
          "percent_off": 25,
          "redeem_by": null,
          "times_redeemed": 96,
          "valid": true
        }
    http_version: 
  recorded_at: Wed, 20 Jan 2016 17:30:59 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_7kveTvcF9APeLI/subscriptions
    body:
      encoding: US-ASCII
      string: plan=test&coupon=25OFF
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.2.3 p173 (2015-08-18)","platform":"x86_64-darwin14","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Pro.local 14.1.1 Darwin Kernel Version 14.1.1: Fri Feb  6
        21:06:10 PST 2015; root:xnu-2782.15.4~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '22'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 20 Jan 2016 17:30:58 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1299'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7kvexn49Fpsvn3
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_7kveDhUgLQGpAi",
          "object": "subscription",
          "application_fee_percent": null,
          "cancel_at_period_end": false,
          "canceled_at": null,
          "current_period_end": 1455989457,
          "current_period_start": 1453311057,
          "customer": "cus_7kveTvcF9APeLI",
          "discount": {
            "object": "discount",
            "coupon": {
              "id": "25OFF",
              "object": "coupon",
              "amount_off": null,
              "created": 1410521489,
              "currency": null,
              "duration": "repeating",
              "duration_in_months": 3,
              "livemode": false,
              "max_redemptions": null,
              "metadata": {},
              "percent_off": 25,
              "redeem_by": null,
              "times_redeemed": 97,
              "valid": true
            },
            "customer": "cus_7kveTvcF9APeLI",
            "end": 1461173457,
            "start": 1453311057,
            "subscription": "sub_7kveDhUgLQGpAi"
          },
          "ended_at": null,
          "metadata": {},
          "plan": {
            "id": "test",
            "object": "plan",
            "amount": 1499,
            "created": 1406556583,
            "currency": "usd",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "name": "Test Plan",
            "statement_descriptor": null,
            "trial_period_days": null
          },
          "quantity": 1,
          "start": 1453311057,
          "status": "active",
          "tax_percent": null,
          "trial_end": null,
          "trial_start": null
        }
    http_version: 
  recorded_at: Wed, 20 Jan 2016 17:31:01 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoices?customer=cus_7kveTvcF9APeLI
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.2.3 p173 (2015-08-18)","platform":"x86_64-darwin14","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Pro.local 14.1.1 Darwin Kernel Version 14.1.1: Fri Feb  6
        21:06:10 PST 2015; root:xnu-2782.15.4~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 20 Jan 2016 17:30:59 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '3393'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7kve9yqE4wV3Il
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "data": [
            {
              "id": "in_17VPnJ2nHroS7mLXykwHzt8b",
              "object": "invoice",
              "amount_due": 1360,
              "application_fee": null,
              "attempt_count": 1,
              "attempted": true,
              "charge": "ch_17VPnJ2nHroS7mLXJLvyvjpy",
              "closed": true,
              "currency": "usd",
              "customer": "cus_7kveTvcF9APeLI",
              "date": 1453311057,
              "description": null,
              "discount": {
                "object": "discount",
                "coupon": {
                  "id": "25OFF",
                  "object": "coupon",
                  "amount_off": null,
                  "created": 1410521489,
                  "currency": null,
                  "duration": "repeating",
                  "duration_in_months": 3,
                  "livemode": false,
                  "max_redemptions": null,
                  "metadata": {},
                  "percent_off": 25,
                  "redeem_by": null,
                  "times_redeemed": 97,
                  "valid": true
                },
                "customer": "cus_7kveTvcF9APeLI",
                "end": 1461173457,
                "start": 1453311057,
                "subscription": "sub_7kveDhUgLQGpAi"
              },
              "ending_balance": 0,
              "forgiven": false,
              "lines": {
                "object": "list",
                "data": [
                  {
                    "id": "ii_17VPnH2nHroS7mLXJioUyY73",
                    "object": "line_item",
                    "amount": 315,
                    "currency": "usd",
                    "description": "vat",
                    "discountable": true,
                    "livemode": false,
                    "metadata": {
                      "type": "vat",
                      "rate": "21"
                    },
                    "period": {
                      "start": 1453311055,
                      "end": 1453311055
                    },
                    "plan": null,
                    "proration": false,
                    "quantity": null,
                    "subscription": null,
                    "type": "invoiceitem"
                  },
                  {
                    "id": "sub_7kveDhUgLQGpAi",
                    "object": "line_item",
                    "amount": 1499,
                    "currency": "usd",
                    "description": null,
                    "discountable": true,
                    "livemode": false,
                    "metadata": {},
                    "period": {
                      "start": 1453311057,
                      "end": 1455989457
                    },
                    "plan": {
                      "id": "test",
                      "object": "plan",
                      "amount": 1499,
                      "created": 1406556583,
                      "currency": "usd",
                      "interval": "month",
                      "interval_count": 1,
                      "livemode": false,
                      "metadata": {},
                      "name": "Test Plan",
                      "statement_descriptor": null,
                      "trial_period_days": null
                    },
                    "proration": false,
                    "quantity": 1,
                    "subscription": null,
                    "type": "subscription"
                  }
                ],
                "has_more": false,
                "total_count": 2,
                "url": "/v1/invoices/in_17VPnJ2nHroS7mLXykwHzt8b/lines"
              },
              "livemode": false,
              "metadata": {},
              "next_payment_attempt": null,
              "paid": true,
              "period_end": 1453311057,
              "period_start": 1453311057,
              "receipt_number": null,
              "starting_balance": 0,
              "statement_descriptor": null,
              "subscription": "sub_7kveDhUgLQGpAi",
              "subtotal": 1814,
              "tax": null,
              "tax_percent": null,
              "total": 1360,
              "webhooks_delivered_at": null
            }
          ],
          "has_more": false,
          "url": "/v1/invoices"
        }
    http_version: 
  recorded_at: Wed, 20 Jan 2016 17:31:02 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_7kveTvcF9APeLI
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - "<AUTH>"
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.2.3 p173 (2015-08-18)","platform":"x86_64-darwin14","publisher":"stripe","uname":"Darwin
        Mattiass-MacBook-Pro.local 14.1.1 Darwin Kernel Version 14.1.1: Fri Feb  6
        21:06:10 PST 2015; root:xnu-2782.15.4~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 20 Jan 2016 17:31:00 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '3097'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7kvegybKgMEaYA
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_7kveTvcF9APeLI",
          "object": "customer",
          "account_balance": 0,
          "created": 1453311052,
          "currency": "usd",
          "default_source": "card_17VPnE2nHroS7mLXXI4P8eNa",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {
            "country_code": "NL",
            "vat_registered": "false",
            "other": "random"
          },
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_17VPnE2nHroS7mLXXI4P8eNa",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_7kveTvcF9APeLI",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 12,
                "exp_year": 2030,
                "fingerprint": "0K7oMWAQAFG7TEob",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7kveTvcF9APeLI/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [
              {
                "id": "sub_7kveDhUgLQGpAi",
                "object": "subscription",
                "application_fee_percent": null,
                "cancel_at_period_end": false,
                "canceled_at": null,
                "current_period_end": 1455989457,
                "current_period_start": 1453311057,
                "customer": "cus_7kveTvcF9APeLI",
                "discount": {
                  "object": "discount",
                  "coupon": {
                    "id": "25OFF",
                    "object": "coupon",
                    "amount_off": null,
                    "created": 1410521489,
                    "currency": null,
                    "duration": "repeating",
                    "duration_in_months": 3,
                    "livemode": false,
                    "max_redemptions": null,
                    "metadata": {},
                    "percent_off": 25,
                    "redeem_by": null,
                    "times_redeemed": 97,
                    "valid": true
                  },
                  "customer": "cus_7kveTvcF9APeLI",
                  "end": 1461173457,
                  "start": 1453311057,
                  "subscription": "sub_7kveDhUgLQGpAi"
                },
                "ended_at": null,
                "metadata": {},
                "plan": {
                  "id": "test",
                  "object": "plan",
                  "amount": 1499,
                  "created": 1406556583,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Test Plan",
                  "statement_descriptor": null,
                  "trial_period_days": null
                },
                "quantity": 1,
                "start": 1453311057,
                "status": "active",
                "tax_percent": null,
                "trial_end": null,
                "trial_start": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7kveTvcF9APeLI/subscriptions"
          }
        }
    http_version: 
  recorded_at: Wed, 20 Jan 2016 17:31:03 GMT
recorded_with: VCR 2.9.2
